Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_atim.h
/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    OCCLR_SEL    FL_ATIM_SetOCRefClearSource
  * @param    TIMx TIM instance
  * @param    OCrefsource This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP2
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP3
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetOCRefClearSource(ATIM_Type* TIMx, uint32_t OCrefsource)
{
    MODIFY_REG(TIMx->AFR, ATIM_AFR_OCCLR_SEL_Msk, OCrefsource);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    OCCLR_SEL    FL_ATIM_GetOCRefClearSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP1
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP2
  *           @arg @ref FL_ATIM_OCREF_CLRSOURCE_COMP3
  */
__STATIC_INLINE uint32_t FL_ATIM_GetOCRefClearSource(ATIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->AFR, ATIM_AFR_OCCLR_SEL_Msk));
}



/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    BKIN1E    FL_ATIM_SetBreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_SetBreakInput(ATIM_Type* TIMx, uint32_t BRKsource)
{
    MODIFY_REG(TIMx->AFR, ATIM_AFR_BKIN1E_Msk, BRKsource);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   AFR    BKSYS3E    FL_ATIM_GetBreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_ATIM_GetBreakInput(ATIM_Type* TIMx, uint32_t BRKsource)
{
   return (uint32_t)(READ_BIT(TIMx->AFR, ATIM_AFR_BKSYS3E_Msk));
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BRKFLAG    BKIN1    FL_ATIM_ClearFlag_BreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE void FL_ATIM_ClearFlag_BreakInput(ATIM_Type* TIMx, uint32_t BRKsource)
{
    MODIFY_REG(TIMx->BRKFLAG, ATIM_AFR_BKIN1E_Msk, BRKsource);
}

/**
  * @brief    
  * @note     仅仅高级定时器支持
  * @rmtoll   BRKFLAG    BKSYS3    FL_ATIM_IsActiveFlag_BreakInput
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_GPIO2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP1
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP2
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP3
  *           @arg @ref FL_ATIM_BKIN_SOURCE_COMP4
  *           @arg @ref FL_ATIM_BKIN_SOURCE_HFDET
  *           @arg @ref FL_ATIM_BKIN_SOURCE_SVD
  *           @arg @ref FL_ATIM_BKIN_SOURCE_LOCKUP
  *           @arg @ref FL_ATIM_BKIN_SOURCE_RAMPARITY
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_ATIM_IsActiveFlag_BreakInput(ATIM_Type* TIMx, uint32_t BRKsource)
{
   return (uint32_t)(READ_BIT(TIMx->BRKFLAG, ATIM_AFR_BKSYS3E_Msk));
}



/**
  * @}
  */

/** @defgroup ATIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ATIM_Init(ATIM_Type *TIMx, FL_ATIM_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_SlaveMode_Init(ATIM_Type *TIMx, FL_ATIM_SlaveInitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_IC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_IC_InitTypeDef *IC_InitStruct);
FL_ErrorStatus FL_ATIM_ETR_Init(ATIM_Type *TIMx, FL_ATIM_ETR_InitTypeDef *TIM_InitStruct);
FL_ErrorStatus FL_ATIM_OC_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_OC_InitTypeDef *TIM_OC_InitStruct);
FL_ErrorStatus FL_ATIM_BDTR_Init(ATIM_Type *TIMx, uint32_t channel, FL_ATIM_BDTR_InitTypeDef *TIM_BDTR_InitStruct);
FL_ErrorStatus FL_ATIM_DeInit(ATIM_Type *TIMx);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_ATIM_H*/


/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-18*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

